
<details><summary>Terraform Plan</summary>

```text

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_membership.member["Art-Atlas"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "Art-Atlas"
    }

  # github_membership.member["Crow314"] will be updated in-place
  ~ resource "github_membership" "member" {
        id       = "ictsc:Crow314"
      ~ role     = "admin" -> "member"
        # (2 unchanged attributes hidden)
    }

  # github_membership.member["Fuuma0000"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "Fuuma0000"
    }

  # github_membership.member["Nishinoyama"] will be updated in-place
  ~ resource "github_membership" "member" {
        id       = "ictsc:Nishinoyama"
      ~ role     = "admin" -> "member"
        # (2 unchanged attributes hidden)
    }

  # github_membership.member["flora058x"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "flora058x"
    }

  # github_membership.member["logica0419"] will be updated in-place
  ~ resource "github_membership" "member" {
        id       = "ictsc:logica0419"
      ~ role     = "admin" -> "member"
        # (2 unchanged attributes hidden)
    }

  # github_membership.member["meronpannn"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "meronpannn"
    }

  # github_membership.member["momoka0122y"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "momoka0122y"
    }

  # github_membership.member["mu-ruU1"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "mu-ruU1"
    }

  # github_membership.member["shuumai587"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "shuumai587"
    }

  # github_team.team["ictsc2023"] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "member of ictsc2023"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "ictsc2023"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_members.team_member["ictsc2022"] will be updated in-place
  ~ resource "github_team_members" "team_member" {
        id      = "7097691"
        # (2 unchanged attributes hidden)

      - members {
          - role     = "maintainer" -> null
          - username = "Crow314" -> null
        }
      - members {
          - role     = "maintainer" -> null
          - username = "Nishinoyama" -> null
        }
      - members {
          - role     = "maintainer" -> null
          - username = "logica0419" -> null
        }
      + members {
          + role     = "member"
          + username = "Crow314"
        }
      + members {
          + role     = "member"
          + username = "Nishinoyama"
        }
      + members {
          + role     = "member"
          + username = "logica0419"
        }

        # (9 unchanged blocks hidden)
    }

  # github_team_members.team_member["ictsc2023"] will be created
  + resource "github_team_members" "team_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "onokatio"
        }
      + members {
          + role     = "maintainer"
          + username = "x86taka"
        }
      + members {
          + role     = "member"
          + username = "Art-Atlas"
        }
      + members {
          + role     = "member"
          + username = "Crow314"
        }
      + members {
          + role     = "member"
          + username = "Fuuma0000"
        }
      + members {
          + role     = "member"
          + username = "Nishinoyama"
        }
      + members {
          + role     = "member"
          + username = "flora058x"
        }
      + members {
          + role     = "member"
          + username = "logica0419"
        }
      + members {
          + role     = "member"
          + username = "meronpannn"
        }
      + members {
          + role     = "member"
          + username = "momoka0122y"
        }
      + members {
          + role     = "member"
          + username = "mu-ruU1"
        }
      + members {
          + role     = "member"
          + username = "shuumai587"
        }
    }

Plan: 9 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>